Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.SetColor(Autodesk.Revit.DB.ColorWithTransparency)
Sets the vertex's color.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Normal
The vertex's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ColorWithTransparency)
Constructs the vertex from a point, a normal vector, and a color.
position:
The vertex's position.
normal:
The vertex's normal vector.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017